ГТС/УТГТС/DataProcessors/ПодборТоваровВДокументПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПодборТоваровВДокументПродажи</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Корзина</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПоставки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураНабора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНабора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОбеспечения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обособленно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ГТС/УТГТС/AccumulationRegisters/ЗапасыИПотребности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗапасыИПотребности</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поступит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьНаСкладе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьПоМереПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтложитьРезервирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОбеспечению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбеспечивать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗакрытьГрафикПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытьГрафикОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгружаемыйЗаказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузка</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаписейЗапасыИПотребности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузкаИлиПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ГТС/УТГТС/AccumulationRegisters/ТоварыКОтгрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКОтгрузке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВРезерве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Собирается</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Собрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/СтатусыПеремещенийТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПеремещенийТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принято</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/DataProcessors/ПодборТоваровВДокументПродажи/Forms/ОстаткиТоваровНаСкладах/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	//Добавляем блок с заменой позиции если это неоригинальная карточка товара, а подмена
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НоменклатураДополнительныеРеквизиты.Свойство.Имя КАК Свойство,
		|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение,
		|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|ГДЕ
		|	НоменклатураДополнительныеРеквизиты.Свойство.Имя = &Наименование
		|	И НоменклатураДополнительныеРеквизиты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Наименование", "ОригинальныйАртикул");
	Запрос.УстановитьПараметр("Ссылка", Параметры.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 				
				Запрос1 = Новый Запрос;
				Запрос1.Текст = 
					"ВЫБРАТЬ
					|	Номенклатура.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.Номенклатура КАК Номенклатура
					|ГДЕ
					|	Номенклатура.Артикул = &Артикул";
				
				Запрос1.УстановитьПараметр("Артикул", ВыборкаДетальныеЗаписи.Значение);
				
				РезультатЗапроса1 = Запрос1.Выполнить();
				
				ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
					ЗапрашиваемаяНоменклатура=Параметры.Номенклатура;
					АртикулЗапрашиваемойНоменклатуры=Параметры.Номенклатура.Артикул;
					Параметры.Номенклатура = ВыборкаДетальныеЗаписи1.Ссылка;
					Элементы.ЗапрашиваемаяНоменклатура.Видимость=Истина;
					Элементы.АртикулЗапрашиваемойНоменклатуры.Видимость=Истина;
				КонецЦикла;
			
	КонецЦикла;
	//	ПараметрыСеанса.ИспользоватьОграниченияПравДоступаНаУровнеЗаписей=Ложь;
	АрхивнаяПозиция=Параметры.Номенклатура.ASP_АрхивнаяПозиция;
	Если АрхивнаяПозиция=Истина Тогда
		Элементы.АрхивнаяПозицияКартинка.Видимость=Истина;
	КонецЕсли;
	Заголовок = Заголовок + ": "+ Параметры.Номенклатура;
	Артикул = Параметры.Номенклатура.Артикул;
	Если ЗначениеЗаполнено(Параметры.Характеристика) Тогда
		Элементы.СписокХарактеристика.Видимость = Ложь;
		Заголовок = Заголовок + " ("+ Параметры.Характеристика + ")";
	КонецЕсли;
	
	Номенклатура = Параметры.Номенклатура;
	Характеристика = Параметры.Характеристика;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"Номенклатура",
		Параметры.Номенклатура,
		ВидСравненияКомпоновкиДанных.Равно, , Истина
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"Характеристика",
		Параметры.Характеристика,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Параметры.Характеристика)
	);
	
	ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
	
	
	//+ ГТС 02062019 получаем комплектацию с остатками и включаем видимость если надо
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ Комплект
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец = &Владелец
		|	И ВариантыКомплектацииНоменклатурыТовары.Ссылка.Основной = &Основной
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0) + ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток, 0) КАК ВРезервеОстаток,
		|	ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток, 0) - (ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0) + ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток, 0)) КАК СвободныйОстаток,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(ТоварыНаСкладахОстатки.КОтгрузкеОстаток, 0) КАК ВНаличииОстаток,
		|	ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0) КАК КОтгрузкеОстаток,
		|	ЕСТЬNULL(ЗапасыИПотребностиОстатки.Склад, ТоварыНаСкладахОстатки.Склад) КАК Склад,
		|	ЕСТЬNULL(ЗапасыИПотребностиОстатки.Номенклатура, ТоварыНаСкладахОстатки.Номенклатура) КАК Номенклатура,
		|	ЕСТЬNULL(ЗапасыИПотребностиОстатки.Характеристика, ТоварыНаСкладахОстатки.Характеристика) КАК Характеристика,
		|	ТоварныеОграничения.МинимальноеКоличествоЗапаса КАК ПлановыйЗапас
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки КАК ЗапасыИПотребностиОстатки
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ТоварыКОтгрузкеОстатки
		|		ПО ЗапасыИПотребностиОстатки.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура
		|			И ЗапасыИПотребностиОстатки.Характеристика = ТоварыКОтгрузкеОстатки.Характеристика
		|			И ЗапасыИПотребностиОстатки.Склад = ТоварыКОтгрузкеОстатки.Склад
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|		ПО ЗапасыИПотребностиОстатки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И ЗапасыИПотребностиОстатки.Характеристика = ТоварыНаСкладахОстатки.Характеристика
		|			И ЗапасыИПотребностиОстатки.Склад = ТоварыНаСкладахОстатки.Склад
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
		|		ПО ЗапасыИПотребностиОстатки.Номенклатура = ТоварныеОграничения.Номенклатура
		|			И ЗапасыИПотребностиОстатки.Характеристика = ТоварныеОграничения.Характеристика
		|			И ЗапасыИПотребностиОстатки.Склад = ТоварныеОграничения.Склад
		|ГДЕ
		|	(ЗапасыИПотребностиОстатки.Номенклатура В
		|				(ВЫБРАТЬ
		|					ТЗ.Номенклатура
		|				ИЗ
		|					Комплект КАК ТЗ)
		|			ИЛИ ТоварыНаСкладахОстатки.Номенклатура В
		|				(ВЫБРАТЬ
		|					ТЗ.Номенклатура
		|				ИЗ
		|					Комплект КАК ТЗ))
		|	И ТоварыНаСкладахОстатки.Склад.ИспользоватьДляСайта = &ИспользоватьДляСайта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Остатки.ВРезервеОстаток + Остатки.КОтгрузкеОстаток КАК ВРезервеОстаток,
		|	Остатки.СвободныйОстаток КАК СвободныйОстаток,
		|	Остатки.ВНаличииОстаток КАК ВНаличииОстаток,
		|	Остатки.Склад КАК Склад,
		|	Остатки.Характеристика КАК Характеристика,
		|	Комплект.Количество КАК Количество,
		|	Комплект.Номенклатура КАК Номенклатура,
		|	Остатки.ПлановыйЗапас КАК ПлановыйЗапас
		|ИЗ
		|	Комплект КАК Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО (Остатки.Номенклатура = Комплект.Номенклатура)
		|			И (Остатки.Характеристика = Комплект.Характеристика)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад,
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("Основной", Истина);
	Запрос.УстановитьПараметр("ИспользоватьДляСайта", Истина);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
		ЭтаФорма.Элементы.ГруппаСоставКомплекта.Видимость = ИСТИНА;
	КонецЕсли;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		новаяСтрока = СоставКомплекта.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока , ВыборкаДетальныеЗаписи);
	КонецЦикла;
	//-ГТС 02062019
	
	//+ГТС 08112019 получаем наличие комплектов в сборе и включаем видимость если надо
	
	Если Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВариантыКомплектацииНоменклатурыТовары.Номенклатура) КАК Номенклатура,
		|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК Количество
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец = &Владелец
		|	И ВариантыКомплектацииНоменклатурыТовары.Ссылка.Основной = &Основной
		|
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец";
	Запрос1.УстановитьПараметр("Владелец", Номенклатура);
	Запрос1.УстановитьПараметр("Основной", Истина);
	
	РезультатЗапроса1 = Запрос1.Выполнить();
	
	ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
	КолвоНоменклатурыВКомплекте=ВыборкаДетальныеЗаписи1.Номенклатура;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец КАК Владелец
		|ПОМЕСТИТЬ Комплект
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец = &Владелец
		|	И ВариантыКомплектацииНоменклатурыТовары.Ссылка.Основной = &Основной
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0) + ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток, 0)) КАК ВРезервеОстаток,
		|	СУММА(ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток, 0) - (ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0) + ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток, 0))) КАК СвободныйОстаток,
		|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(ТоварыНаСкладахОстатки.КОтгрузкеОстаток, 0)) КАК ВНаличииОстаток,
		|	СУММА(ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0)) КАК КОтгрузкеОстаток,
		|	ЕСТЬNULL(ЗапасыИПотребностиОстатки.Склад, ТоварыНаСкладахОстатки.Склад) КАК Склад,
		|	ЕСТЬNULL(ЗапасыИПотребностиОстатки.Номенклатура, ТоварыНаСкладахОстатки.Номенклатура) КАК Номенклатура,
		|	ЕСТЬNULL(ЗапасыИПотребностиОстатки.Характеристика, ТоварыНаСкладахОстатки.Характеристика) КАК Характеристика
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки КАК ЗапасыИПотребностиОстатки
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ТоварыКОтгрузкеОстатки
		|		ПО ЗапасыИПотребностиОстатки.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура
		|			И ЗапасыИПотребностиОстатки.Характеристика = ТоварыКОтгрузкеОстатки.Характеристика
		|			И ЗапасыИПотребностиОстатки.Склад = ТоварыКОтгрузкеОстатки.Склад
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|		ПО ЗапасыИПотребностиОстатки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И ЗапасыИПотребностиОстатки.Характеристика = ТоварыНаСкладахОстатки.Характеристика
		|			И ЗапасыИПотребностиОстатки.Склад = ТоварыНаСкладахОстатки.Склад
		|ГДЕ
		|	(ЗапасыИПотребностиОстатки.Номенклатура В
		|				(ВЫБРАТЬ
		|					ТЗ.Номенклатура
		|				ИЗ
		|					Комплект КАК ТЗ)
		|			ИЛИ ТоварыНаСкладахОстатки.Номенклатура В
		|				(ВЫБРАТЬ
		|					ТЗ.Номенклатура
		|				ИЗ
		|					Комплект КАК ТЗ))
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ЗапасыИПотребностиОстатки.Склад, ТоварыНаСкладахОстатки.Склад),
		|	ЕСТЬNULL(ЗапасыИПотребностиОстатки.Номенклатура, ТоварыНаСкладахОстатки.Номенклатура),
		|	ЕСТЬNULL(ЗапасыИПотребностиОстатки.Характеристика, ТоварыНаСкладахОстатки.Характеристика)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СУММА(Остатки.ВРезервеОстаток + Остатки.КОтгрузкеОстаток) КАК ВРезервеОстаток,
		|	СУММА(Остатки.СвободныйОстаток) КАК СвободныйОстаток,
		|	СУММА(Остатки.ВНаличииОстаток) КАК ВНаличииОстаток,
		|	Остатки.Склад КАК Склад,
		|	Остатки.Характеристика КАК Характеристика,
		|	СУММА(Комплект.Количество) КАК Количество,
		|	Комплект.Номенклатура КАК Номенклатура,
		|	СУММА(Остатки.СвободныйОстаток) / СУММА(Комплект.Количество) КАК Свободно,
		|	Комплект.Владелец КАК Владелец,
		|	СУММА(Остатки.ВНаличииОстаток) / СУММА(Комплект.Количество) КАК ВНаличии
		|ПОМЕСТИТЬ ДоступноДляКомплектов
		|ИЗ
		|	Комплект КАК Комплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО (Остатки.Номенклатура = Комплект.Номенклатура)
		|			И (Остатки.Характеристика = Комплект.Характеристика)
		|ГДЕ
		|	Остатки.ВНаличииОстаток > 0
		|	И Остатки.СвободныйОстаток > 0
		|	И Остатки.Склад.ИспользоватьДляСайта = &ИспользоватьДляСайта
		|
		|СГРУППИРОВАТЬ ПО
		|	Комплект.Номенклатура,
		|	Остатки.Склад,
		|	Остатки.Характеристика,
		|	Комплект.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоступноДляКомплектов.Владелец КАК Владелец,
		|	ДоступноДляКомплектов.Склад КАК Склад,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА ДоступноДляКомплектов.ВНаличии >= 0
		|				ТОГДА ВЫРАЗИТЬ(ДоступноДляКомплектов.ВНаличии - 0.5 КАК ЧИСЛО(10, 0))
		|			ИНАЧЕ ВЫРАЗИТЬ(ДоступноДляКомплектов.ВНаличии + 0.5 КАК ЧИСЛО(10, 0))
		|		КОНЕЦ) КАК ВНаличии,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА ДоступноДляКомплектов.Свободно >= 0
		|				ТОГДА ВЫРАЗИТЬ(ДоступноДляКомплектов.Свободно - 0.5 КАК ЧИСЛО(10, 0))
		|			ИНАЧЕ ВЫРАЗИТЬ(ДоступноДляКомплектов.Свободно + 0.5 КАК ЧИСЛО(10, 0))
		|		КОНЕЦ) КАК Свободно,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДоступноДляКомплектов.Номенклатура) КАК Номенклатура
		|ИЗ
		|	ДоступноДляКомплектов КАК ДоступноДляКомплектов
		|ГДЕ
		|	ДоступноДляКомплектов.ВНаличии >= 1
		|	И ДоступноДляКомплектов.Свободно >= 1
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступноДляКомплектов.Владелец,
		|	ДоступноДляКомплектов.Склад
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("Основной", Истина);
	Запрос.УстановитьПараметр("ИспользоватьДляСайта", Истина);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
		ЭтаФорма.Элементы.ИтогоДоступноНаборов.Видимость = ИСТИНА;
		ЭтаФорма.Элементы.ГруппаТоварыНаСкладах.Видимость = Ложь;
	КонецЕсли;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если КолвоНоменклатурыВКомплекте=ВыборкаДетальныеЗаписи.Номенклатура Тогда
		новаяСтрока = ДоступноНаборов.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока , ВыборкаДетальныеЗаписи);
		Иначе
		КонецЕсли;
	КонецЦикла;
	Иначе
	КонецЕсли;
	//-ГТС 08112019 получаем наличие комплектов в сборе и включаем видимость если надо

	
	//+ ГТС 04062019 получаем заказы поставщику и включаем видимость если надо	
		
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ГрафикПоступленияТоваров.Номенклатура КАК Номенклатура,
	//	|	ГрафикПоступленияТоваров.Склад КАК Склад,
	//	|	ГрафикПоступленияТоваров.Характеристика КАК Характеристика,
	//	|	ГрафикПоступленияТоваров.Назначение КАК Назначение,
	//	|	ЕСТЬNULL(ГрафикПоступленияТоваров.КОформлениюПоступленийПоРаспоряжению, 0) КАК Количество,
	//	|	ГрафикПоступленияТоваров.Период КАК ДатаПоставки,
	//	|	ГрафикПоступленияТоваров.Регистратор КАК ЗаказПоставщику
	//	|ИЗ
	//	|	РегистрНакопления.ТоварыКПоступлению КАК ГрафикПоступленияТоваров
	//	|ГДЕ
	//	|	ГрафикПоступленияТоваров.Номенклатура = &Номенклатура
	//	|	И ГрафикПоступленияТоваров.Характеристика = &Характеристика
	//	|	И ГрафикПоступленияТоваров.Регистратор ССЫЛКА Документ.ЗаказПоставщику
	//	|	И ГрафикПоступленияТоваров.Период > &Период
	//	|	И ЕСТЬNULL(ГрафикПоступленияТоваров.КОформлениюПоступленийПоРаспоряжению, 0) > 0
	//	|	И ГрафикПоступленияТоваров.Регистратор.Статус <> ЗНАЧЕНИЕ(перечисление.Статусызаказовпоставщикам.закрыт)";

	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	               |	ЗапасыИПотребностиОстатки.Склад КАК Склад,
	               |	ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
	               |	ЗапасыИПотребностиОстатки.Назначение КАК Назначение,
	               |	ЗапасыИПотребностиОстатки.ПоступитОстаток КАК Количество,
	               |	ЗапасыИПотребностиОстатки.ДатаСобытия КАК ДатаПоставки,
	               |	ЗапасыИПотребностиОстатки.Заказ КАК ЗаказПоставщику
	               |ИЗ
	               |	РегистрНакопления.ЗапасыИПотребности.Остатки КАК ЗапасыИПотребностиОстатки
	               |ГДЕ
	               |	ЗапасыИПотребностиОстатки.Номенклатура = &Номенклатура
	               |	И ТИПЗНАЧЕНИЯ(ЗапасыИПотребностиОстатки.Заказ) = ТИП(Документ.ЗаказПоставщику)
	               |	И ЗапасыИПотребностиОстатки.ДатаСобытия >= &Период
	               |	И ЗапасыИПотребностиОстатки.Заказ.Статус <> ЗНАЧЕНИЕ(перечисление.Статусызаказовпоставщикам.закрыт)
	               |	И ЗапасыИПотребностиОстатки.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	//Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата())); 05.03.2024 - показать просроченные заказы поставщикам	
	Запрос.УстановитьПараметр("Период", ДобавитьМесяц(ТекущаяДата(), -1));
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
		ЭтаФорма.Элементы.ГруппаЗаказыПоставщикам.Видимость = ИСТИНА;
	КонецЕсли;

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		новаяСтрока = ЗаказыПоставщикам.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока , ВыборкаДетальныеЗаписи);
	КонецЦикла;
	//- ГТС 04062019 получаем заказы поставщику и включаем видимость если надо
	
	//+ГТС получаем ожидаемые перемещения на склады. 03.03.2020
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыКОтгрузке.Регистратор.СкладПолучатель КАК Склад,
		|	ТоварыКОтгрузке.КОтгрузке КАК Количество,
		|	ПеремещениеТоваровТовары.Назначение КАК Назначение,
		|	ТоварыКОтгрузке.Регистратор.Дата КАК ДатаПоставки,
		|	ПеремещениеТоваровТовары.Ссылка КАК Перемещение
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|		ПО ТоварыКОтгрузке.Регистратор = ПеремещениеТоваровТовары.Ссылка
		|			И ТоварыКОтгрузке.Номенклатура = ПеремещениеТоваровТовары.Номенклатура
		|			И ТоварыКОтгрузке.КОтгрузке = ПеремещениеТоваровТовары.Количество
		|			И ТоварыКОтгрузке.ДокументОтгрузки = ПеремещениеТоваровТовары.ЗаказНаПеремещение
		|ГДЕ
		|	ТоварыКОтгрузке.Номенклатура = &Номенклатура
		|	И ТоварыКОтгрузке.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|	И ТоварыКОтгрузке.Регистратор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенийТоваров.Отгружено)
		|	И ТоварыКОтгрузке.Характеристика = &Характеристика
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПоставки,
		|	Назначение";
		//"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ТоварыКОтгрузке.Регистратор.СкладПолучатель КАК Склад,
		//|	ТоварыКОтгрузке.КОтгрузке КАК Количество,
		//|	ВложенныйЗапрос.Назначение КАК Назначение,
		//|	ТоварыКОтгрузке.Регистратор.Дата КАК ДатаПоставки,
		//|	ВложенныйЗапрос.Ссылка КАК Перемещение
		//|ИЗ
		//|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
		//|			ПеремещениеТоваровТовары.Характеристика КАК Характеристика,
		//|			ПеремещениеТоваровТовары.Упаковка КАК Упаковка,
		//|			СУММА(ПеремещениеТоваровТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
		//|			ПеремещениеТоваровТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		//|			ПеремещениеТоваровТовары.СтатусУказанияСерийОтправитель КАК СтатусУказанияСерийОтправитель,
		//|			ПеремещениеТоваровТовары.СтатусУказанияСерийПолучатель КАК СтатусУказанияСерийПолучатель,
		//|			ПеремещениеТоваровТовары.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
		//|			ПеремещениеТоваровТовары.Сделка КАК Сделка,
		//|			ПеремещениеТоваровТовары.Назначение КАК Назначение,
		//|			ПеремещениеТоваровТовары.НазначениеОтправителя КАК НазначениеОтправителя,
		//|			ПеремещениеТоваровТовары.Серия КАК Серия,
		//|			ПеремещениеТоваровТовары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
		//|			ПеремещениеТоваровТовары.ASP_ЗаказКлиента КАК ASP_ЗаказКлиента,
		//|			ПеремещениеТоваровТовары.НоменклатураНабора КАК НоменклатураНабора,
		//|			ПеремещениеТоваровТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
		//|			ПеремещениеТоваровТовары.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
		//|			ПеремещениеТоваровТовары.Ссылка КАК Ссылка,
		//|			СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество
		//|		ИЗ
		//|			Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		//|		
		//|		СГРУППИРОВАТЬ ПО
		//|			ПеремещениеТоваровТовары.Номенклатура,
		//|			ПеремещениеТоваровТовары.Характеристика,
		//|			ПеремещениеТоваровТовары.Упаковка,
		//|			ПеремещениеТоваровТовары.СтатусУказанияСерий,
		//|			ПеремещениеТоваровТовары.СтатусУказанияСерийОтправитель,
		//|			ПеремещениеТоваровТовары.СтатусУказанияСерийПолучатель,
		//|			ПеремещениеТоваровТовары.ЗаказНаПеремещение,
		//|			ПеремещениеТоваровТовары.Сделка,
		//|			ПеремещениеТоваровТовары.Назначение,
		//|			ПеремещениеТоваровТовары.НазначениеОтправителя,
		//|			ПеремещениеТоваровТовары.Серия,
		//|			ПеремещениеТоваровТовары.АналитикаУчетаНоменклатуры,
		//|			ПеремещениеТоваровТовары.ASP_ЗаказКлиента,
		//|			ПеремещениеТоваровТовары.НоменклатураНабора,
		//|			ПеремещениеТоваровТовары.ХарактеристикаНабора,
		//|			ПеремещениеТоваровТовары.АналитикаУчетаНаборов,
		//|			ПеремещениеТоваровТовары.Ссылка) КАК ВложенныйЗапрос
		//|		ПО ТоварыКОтгрузке.Регистратор = ВложенныйЗапрос.Ссылка
		//|			И ТоварыКОтгрузке.Номенклатура = ВложенныйЗапрос.Номенклатура
		//|			И ТоварыКОтгрузке.КОтгрузке = ВложенныйЗапрос.Количество
		//|			И ТоварыКОтгрузке.ДокументОтгрузки = ВложенныйЗапрос.ЗаказНаПеремещение
		//|ГДЕ
		//|	ТоварыКОтгрузке.Номенклатура = &Номенклатура
		//|	И ТоварыКОтгрузке.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		//|	И ТоварыКОтгрузке.Регистратор.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПеремещенийТоваров.Отгружено)
		//|	И ТоварыКОтгрузке.Характеристика = &Характеристика
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	ДатаПоставки,
		//|	Назначение";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
	ЭтаФорма.Элементы.ГруппаПеремещается.Видимость = ИСТИНА;
	КонецЕсли;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		новаяСтрока = Перемещается.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока , ВыборкаДетальныеЗаписи);
	КонецЦикла;
	//-ГТС получаем ожидаемые перемещения на склады. 03.03.2020
	
	//+ГТС получаем ожидаемые сборки 16.11.2021
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыНаСборкуОстатки.ЗаказНаСборку КАК ЗаказНаСборку,
		|	ЗаказыНаСборкуОстатки.ЗаказаноОстаток КАК Количество,
		|	ЗаказыНаСборкуОстатки.ЗаказНаСборку.Назначение КАК Назначение,
		|	ЗаказыНаСборкуОстатки.ЗаказНаСборку.ОкончаниеСборкиРазборки КАК ДатаПоставки,
		|	ЗаказыНаСборкуОстатки.ЗаказНаСборку.Склад КАК Склад
		|ИЗ
		|	РегистрНакопления.ЗаказыНаСборку.Остатки КАК ЗаказыНаСборкуОстатки
		|ГДЕ
		|	ЗаказыНаСборкуОстатки.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
	ЭтаФорма.Элементы.ГруппаСборки.Видимость = ИСТИНА;
	КонецЕсли;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		новаяСтрока = ЗаказыНаСборку.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока , ВыборкаДетальныеЗаписи);
	КонецЦикла;
	//-ГТС получаем ожидаемые сборки 16.11.2021
	
	
	//+ гтс 04062019
	// tise добавил 2010-12-07
	ЗапросОстатокРезервов = Новый Запрос;
	ЗапросОстатокРезервов.Текст =
	"ВЫБРАТЬ
	|	ЗапасыИПотребностиОстатки.Склад КАК Склад,
	|	ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыИПотребностиОстатки.Характеристика КАК Характеристика,
	|	ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток + ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток КАК ВРезервеОстаток
	|ИЗ
	|	РегистрНакопления.ЗапасыИПотребности.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика) КАК ЗапасыИПотребностиОстатки";
	ЗапросОстатокРезервов.УстановитьПараметр("Номенклатура", Номенклатура);
	ЗапросОстатокРезервов.УстановитьПараметр("Характеристика", Характеристика);
	
	ТЗ_ОстаткиРезервов = ЗапросОстатокРезервов.Выполнить().Выгрузить();
	
	УстановитьПривилегированныйРежим(Истина);
	ЗапросРезервыПоЗаказам = Новый Запрос;
	ЗапросРезервыПоЗаказам.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказыКлиентовОстатки.ДокументОтгрузки КАК ЗаказКлиента,
	|	ЗаказыКлиентовОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыКлиентовОстатки.Характеристика КАК Характеристика,
	|	ЗаказыКлиентовОстатки.Склад КАК Склад,
	// Добавлена часть для заказов на перемещение, на проверке. 15.12.2022
	//|	ЗаказыКлиентовОстатки.ВРезервеОстаток КАК ЗаказаноОстаток,
	|Выбор когда ДвижениеТоваров.ПланируемоеПоступлениеПодЗаказ>0 И ТИПЗНАЧения(ЗаказыКлиентовОстатки.ДокументОтгрузки)=ТИП(Документ.ЗаказНаПеремещение) Тогда ДвижениеТоваров.ПланируемоеПоступлениеПодЗаказ 
	|Когда ДвижениеТоваров.ПланируемоеПоступление>0 И ТИПЗНАЧения(ЗаказыКлиентовОстатки.ДокументОтгрузки)=ТИП(Документ.ЗаказНаПеремещение) Тогда ДвижениеТоваров.ПланируемоеПоступление
	|Иначе
	|ЗаказыКлиентовОстатки.ВРезервеОстаток
	|Конец	
	|КАК ЗаказаноОстаток,
    //Конец добавленной 15.12.2022 части
	|	ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоДокументамОбороты.РасчетныйДокумент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОплата,
	|	ВЫБОР
	|		КОГДА ЗаказыКлиентовОстатки.ДокументОтгрузки.Менеджер ЕСТЬ NULL
	|			ТОГДА ЗаказыКлиентовОстатки.ДокументОтгрузки.Ответственный
	|		ИНАЧЕ ЗаказыКлиентовОстатки.ДокументОтгрузки.Менеджер
	|	КОНЕЦ КАК Менеджер,
	|	ДвижениеТоваров.Назначение КАК Назначение
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Характеристика = &Характеристика) КАК ЗаказыКлиентовОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам.Обороты(, , Регистратор, ) КАК РасчетыСКлиентамиПоДокументамОбороты
	|		ПО ЗаказыКлиентовОстатки.ДокументОтгрузки = РасчетыСКлиентамиПоДокументамОбороты.ЗаказКлиента.Объект
	|			И (РасчетыСКлиентамиПоДокументамОбороты.РасчетныйДокумент ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|				ИЛИ РасчетыСКлиентамиПоДокументамОбороты.РасчетныйДокумент ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвижениеТоваров КАК ДвижениеТоваров
	|		ПО (ЗаказыКлиентовОстатки.ДокументОтгрузки = ДвижениеТоваров.Регистратор И ЗаказыКлиентовОстатки.Номенклатура = ДвижениеТоваров.Номенклатура)
	|ГДЕ
	|	ЗаказыКлиентовОстатки.ВРезервеОстаток > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕстьОплата,
	|	ЗаказыКлиентовОстатки.ДокументОтгрузки
	|АВТОУПОРЯДОЧИВАНИЕ";
	ЗапросРезервыПоЗаказам.УстановитьПараметр("Номенклатура", Номенклатура);
	ЗапросРезервыПоЗаказам.УстановитьПараметр("Характеристика", Характеристика);
	
	ВыборкаРезервыПоЗаказам = ЗапросРезервыПоЗаказам.Выполнить().Выбрать();
	ОтборСтрок = Новый Структура("Номенклатура, Характеристика,Склад");
	Пока ВыборкаРезервыПоЗаказам.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОтборСтрок, ВыборкаРезервыПоЗаказам);
		СтрокиОстатокРезерва = ТЗ_ОстаткиРезервов.НайтиСтроки(ОтборСтрок);
		Если СтрокиОстатокРезерва.Количество() > 0 Тогда
			СтрокаОстатокРезерва = СтрокиОстатокРезерва[0];
			Осталось = СтрокаОстатокРезерва.ВРезервеОстаток;
			Если Осталось <= 0 Тогда
				ТЗ_ОстаткиРезервов.Удалить(СтрокаОстатокРезерва);
				Продолжить;
			КонецЕсли;
			
			
			СтрокаРезервыПоЗаказам = РезервыПоЗаказам.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезервыПоЗаказам, ВыборкаРезервыПоЗаказам);
			Списать = Мин(СтрокаОстатокРезерва.ВРезервеОстаток, ВыборкаРезервыПоЗаказам.ЗаказаноОстаток);
			Если ВыборкаРезервыПоЗаказам.ЕстьОплата Тогда
				СтрокаРезервыПоЗаказам.Оплачено = Списать;
			Иначе
				СтрокаРезервыПоЗаказам.НеОплачено = Списать;
			КонецЕсли;	
			
			СтрокаОстатокРезерва.ВРезервеОстаток = СтрокаОстатокРезерва.ВРезервеОстаток - Списать;
		КонецЕсли;	
	КонецЦикла;
	
	Элементы.НадписьВсегоНеОплаченныхРезервов.Заголовок = "Всего неоплаченных резервов по заказам клиентов: " + РезервыПоЗаказам.Итог("НеОплачено");
	
	Элементы.НадписьВсегоОплаченныхРезервов.Заголовок = "Всего оплаченных резервов по заказам клиентов: " + РезервыПоЗаказам.Итог("Оплачено");
	// /tise добавил 2010-12-07
	
	//Попытка
	ДопСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Срок поставки от поставщика");
	СрокПоставки = УправлениеСвойствами.ЗначениеСвойства(Номенклатура, ДопСвойство);
	ДопСвойствоПохожих = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Похожие модели");
	СтрокаПохожихМоделей=строка(УправлениеСвойствами.ЗначениеСвойства(Номенклатура,ДопСвойствоПохожих));
	Если ЗначениеЗаполнено(СтрокаПохожихМоделей) Тогда
	ОстаткиПохожихМоделей(Номенклатура,Характеристика,СтрокаПохожихМоделей);
	КонецЕсли;
	//Исключение
	//Сообщить("Исключение");
	//КонецПопытки;
	
	//ПараметрыСеанса.ИспользоватьОграниченияПравДоступаНаУровнеЗаписей=Истина;
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ГрафикДоступностиТоваров.Отбор,
			"Склад",
			ТекущиеДанные.Склад,
			ВидСравненияКомпоновкиДанных.Равно, , Истина
		);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ГрафикДоступностиТоваров.Отбор,
			"Номенклатура",
			Номенклатура,
			ВидСравненияКомпоновкиДанных.Равно, , Истина
		);
		
		Если ИспользоватьХарактеристикиНоменклатуры Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				ГрафикДоступностиТоваров.Отбор,
				"Характеристика",
				Характеристика,
				ВидСравненияКомпоновкиДанных.Равно, , Истина
			);
		КонецЕсли;
		
		// tise добавил 2010-12-06
		//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		//	РезервыПоЗаказам,
		//	"Склад",
		//	ТекущиеДанные.Склад,
		//	Истина, ВидСравненияКомпоновкиДанных.Равно
		//);
		//
		//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		//	РезервыПоЗаказам,
		//	"Номенклатура",
		//	Номенклатура,
		//	Истина, ВидСравненияКомпоновкиДанных.Равно
		//);
		//
		//Если ИспользоватьХарактеристикиНоменклатуры Тогда
		//	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		//		РезервыПоЗаказам,
		//		"Характеристика",
		//		Характеристика,
		//		Истина, ВидСравненияКомпоновкиДанных.Равно
		//	);
		//КонецЕсли;
		// /tise добавил 2010-12-06
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ГрафикДоступностиТоваров.Отбор,
			"Склад",
			Неопределено,
			ВидСравненияКомпоновкиДанных.Равно, , Истина
		);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ГрафикДоступностиТоваров.Отбор,
			"Номенклатура",
			Неопределено,
			ВидСравненияКомпоновкиДанных.Равно, , Истина
		);
		
		Если ИспользоватьХарактеристикиНоменклатуры Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				ГрафикДоступностиТоваров.Отбор,
				"Характеристика",
				Неопределено,
				ВидСравненияКомпоновкиДанных.Равно, , Истина
			);
		КонецЕсли;
		
		// tise добавил 2010-12-06
		//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		//	РезервыПоЗаказам,
		//	"Склад",
		//	Неопределено,
		//	Истина, ВидСравненияКомпоновкиДанных.Равно
		//);
		//
		//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		//	РезервыПоЗаказам,
		//	"Номенклатура",
		//	Неопределено,
		//	Истина, ВидСравненияКомпоновкиДанных.Равно
		//);
		//
		//Если ИспользоватьХарактеристикиНоменклатуры Тогда
		//	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		//		РезервыПоЗаказам,
		//		"Характеристика",
		//		Неопределено,
		//		Истина, ВидСравненияКомпоновкиДанных.Равно
		//	);
		//КонецЕсли;
		// /tise добавил 2010-12-06
	КонецЕсли;
	
КонецПроцедуры

// tise добавил 2010-12-06
&НаКлиенте
Процедура РезервыПоЗаказамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элементы.РезервыПоЗаказам.ТекущиеДанные.ЗаказКлиента);
КонецПроцедуры


&НаКлиенте
Процедура ЗаказыПоставщикамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элементы.ЗаказыПоставщикам.ТекущиеДанные.Назначение) И Поле.Имя="ЗаказыПоставщикамНазначение" Тогда
	ОткрытьЗначение(ПолучитьЗаказПоНазначению(Элементы.ЗаказыПоставщикам.ТекущиеДанные.Назначение));	
	Иначе
	ОткрытьЗначение(Элементы.ЗаказыПоставщикам.ТекущиеДанные.ЗаказПоставщику);
	КонецЕсли

КонецПроцедуры


&НаКлиенте
Процедура ПеремещаетсяВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элементы.Перемещается.ТекущиеДанные.Назначение) И Поле.Имя="ПеремещаетсяНазначение" Тогда
	ОткрытьЗначение(ПолучитьЗаказПоНазначению(Элементы.Перемещается.ТекущиеДанные.Назначение));	
	Иначе
	ОткрытьЗначение(Элементы.Перемещается.ТекущиеДанные.Перемещение);
	КонецЕсли
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаказПоНазначению(Назначение)
Возврат Назначение.Заказ;
КонецФункции


&НаКлиенте
Процедура СоставКомплектаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//ОткрытьЗначение(Элементы.СоставКомплекта.ТекущиеДанные.СоставКомплектаНоменклатура);
	//ВыбраннаяСтрока = Элементы.СоставКомплекта.ТекущиеДанные.СоставКомплектаНоменклатура;
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ВыбраннаяСтрока);
	//ТекущаяСтрока = Элементы.СоставКомплекта.ТекущиеДанные.СоставКомплектаНоменклатура;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Дата", ТекущаяДата());
	ПараметрыФормы.Вставить("Номенклатура", Элементы.СоставКомплекта.ТекущиеДанные.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма.ОстаткиТоваровНаСкладах", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
КонецПроцедуры


&НаКлиенте
Процедура ЗаказыНаСборкуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элементы.ЗаказыНаСборку.ТекущиеДанные.Назначение) И Поле.Имя="ЗаказыНаСборкуНазначение" Тогда
	ОткрытьЗначение(ПолучитьЗаказПоНазначению(Элементы.ЗаказыНаСборку.ТекущиеДанные.Назначение));	
	Иначе
	ОткрытьЗначение(Элементы.ЗаказыНаСборку.ТекущиеДанные.ЗаказыНаСборкуЗаказНаСборку);
	КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ОстаткиПохожихМоделей(Номенклатура,Характеристика,СтрокаПохожихМоделей);
	МассивАртикулов=СтрРазделить(СтрокаПохожихМоделей, "|" , Ложь);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК НоменклатураСсылка,
		|	Номенклатура.Артикул КАК Артикул
		|ПОМЕСТИТЬ СправочникНоменклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул В(&Артикул)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СправочникНоменклатура.НоменклатураСсылка КАК Номенклатура,
		|	СправочникНоменклатура.Артикул КАК Артикул,
		|	СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК Свободно,
		|	СУММА(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток) КАК ВРезерве
		|ИЗ
		|	РегистрНакопления.ЗапасыИПотребности.Остатки КАК ЗапасыИПотребностиОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СправочникНоменклатура КАК СправочникНоменклатура
		|		ПО ЗапасыИПотребностиОстатки.Номенклатура = СправочникНоменклатура.НоменклатураСсылка
		|ГДЕ
		|	ЗапасыИПотребностиОстатки.Номенклатура В
		|			(ВЫБРАТЬ
		|				СправочникНоменклатура.НоменклатураСсылка КАК Номенклатура
		|			ИЗ
		|				СправочникНоменклатура КАК СправочникНоменклатура)
		|	И ЗапасыИПотребностиОстатки.Склад.ASP_ИспользоватьДляРасчетаОстатков = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	СправочникНоменклатура.НоменклатураСсылка,
		|	СправочникНоменклатура.Артикул";
	
	Запрос.УстановитьПараметр("Артикул", МассивАртикулов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока=ПохожиеМодели.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
		Элементы.ПохожиеМодели.Видимость=Истина;
	КонецЦикла;
		
	
КонецПроцедуры

&НаКлиенте
Процедура ПохожиеМоделиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ВыбраннаяСтрока);
	//ТекущаяСтрока = Элементы.СоставКомплекта.ТекущиеДанные.СоставКомплектаНоменклатура;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Дата", ТекущаяДата());
	ПараметрыФормы.Вставить("Номенклатура", Элементы.ПохожиеМодели.ТекущиеДанные.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма.ОстаткиТоваровНаСкладах", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура Цены(Команда)
		// Вставить содержимое обработчика.
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Дата", ТекущаяДата());
	ПараметрыФормы.Вставить("Номенклатура", Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма.ЦеныНоменклатуры", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура НаСайте(Команда)
	ЗапуститьПриложение("https://gortorgsnab.ru/search/?q="+Артикул);
КонецПроцедуры

&НаКлиенте
Процедура Карточка(Команда)
	ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Дата", ТекущаяДата());
	ПараметрыФормы.Вставить("Ключ", Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"));
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма)
КонецПроцедуры

// /tise добавил 2010-12-06
